<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => ' :ատրիբուտը պետք է ընդունվի',
    'active_url' => ' :ատրիբուտը վավեր URL չէ',
    'after' => ' :ատրիբուտը պետք է լինի դրանից հետո :ամսաթիվը.',
    'after_or_equal' => ' :ատրիբուտը պետք է լինի ամսաթվից հետո կամ հավասար :ամսաթիվը.',
    'alpha' => ' :ատրիբուտը կարող է պարունակել միայն տառեր.',
    'alpha_dash' => ' :ատրիբուտը կարող է պարունակել միայն տառեր, համարներ, բադեր և ներքևներ.',
    'alpha_num' => ' :ատրիբուտը կարող է պարունակել միայն տառեր, համարներ, բադեր և ներքևներ.',
    'array' => ' :ատրիբուտը պետք է լինի զանգված.',
    'before' => ' :ատրիբուտը պետք է լինի նախօրոք :ամսաթիվը.',
    'before_or_equal' => ' :ատրիբուտը պետք է լինի ամսաթվից առաջ կամ հավասար :ամսաթիվը.',
    'between' => [
        'numeric' => ' :ատրիբուտը պետք է լինի միջև :մին և :առավելագույնը.',
        'file' => ' :ատրիբուտը պետք է լինի միջև :մին և :առավելագույն կիլոբայթ.',
        'string' => ' :ատրիբուտը պետք է լինի միջև :մին և :առավելագույն նիշ.',
        'array' => ' :ատրիբուտը պետք է միջև լինի :մին և :առավելագույն իրերը.',
    ],
    'boolean' => ' :ատրիբուտների դաշտը պետք է լինի ճշմարիտ կամ կեղծ.',
    'confirmed' => ' :ատրիբուտի հաստատումը չի համընկնում.',
    'date' => ' :ատրիբուտը վավեր ամսաթիվ չէ.',
    'date_equals' => ' :ատրիբուտը պետք է լինի հավասար ամսաթվին :ամսաթիվը.',
    'date_format' => ' :ատրիբուտը չի համապատասխանում ձևաչափին :ձևաչափ.',
    'different' => ' :ատրիբուտ և :մյուսը պետք է տարբեր լինի.',
    'digits' => ' :ատրիբուտը պետք է լինի :digits digits.',
    'digits_between' => ' :ատրիբուտը պետք է լինի միջև :մին և :առավելագույն digits.',
    'dimensions' => ' :ատրիբուտը պատկերի անվավեր չափեր ունի.',
    'distinct' => ' :ատրիբուտների դաշտը ունի կրկնօրինակ արժեք.',
    'email' => ' :ատրիբուտը պետք է լինի վավեր էլփոստի հասցե.',
    'ends_with' => ' :ատրիբուտը պետք է ավարտվի հետևյալներից մեկով: :արժեքները.',
    'exists' => ' ընտրված :ատրիբուտը անվավեր է.',
    'file' => ' :ատրիբուտը պետք է լինի ֆայլ.',
    'filled' => ' :ատրիբուտների դաշտը պետք է ունենա արժեք.',
    'gt' => [
        'numeric' => ' :ատրիբուտը պետք է լինի ավելի մեծ, քան :արժեքը.',
        'file' => ' :ատրիբուտը պետք է լինի ավելի մեծ, քան :արժեքը կիլոբայթ.',
        'string' => ' :ատրիբուտը պետք է լինի ավելի մեծ, քան :արժեքի նիշ.',
        'array' => ' :ատրիբուտը պետք է ունենա ավելին քան :արժեքի իրերը.',
    ],
    'gte' => [
        'numeric' => ' :ատրիբուտը պետք է լինի ավելի մեծ կամ հավասար :արժեքը.',
        'file' => ' :ատրիբուտը պետք է լինի ավելի մեծ կամ հավասար :արժեքը կիլոբայթ.',
        'string' => ' :ատրիբուտը պետք է լինի ավելի մեծ կամ հավասար :արժեքի նիշ.',
        'array' => ' :ատրիբուտը պետք է ունենա :արժեքի իրեր կամ ավելին.',
    ],
    'image' => ' :ատրիբուտը պետք է լինի պատկեր.',
    'in' => ' ընտրված :ատրիբուտը անվավեր է.',
    'in_array' => ' :ատրիբուտների դաշտը գոյություն չունի :այլ.',
    'integer' => ' :ատրիբուտը պետք է լինի ամբողջ թիվ.',
    'ip' => ' :ատրիբուտը պետք է լինի վավեր IP հասցե.',
    'ipv4' => ': հատկանիշը պետք է լինի վավեր IPv4 հասցե',
    'ipv6' => '. հատկանիշը պետք է լինի վավեր IPv6 հասցե.',
    'json' => '. ատրիբուտը պետք է լինի JSON տողի վավեր:',
    'lt' => [
        'numeric' => ': ատրիբուտը պետք է լինի ավելի ցածր, քան արժեքը.',
        'file' => ': հատկանիշը պետք է պակաս լինի ՝ արժեքը կիլոբայթից.',
        'string' => ': հատկանիշը պետք է պակաս լինի: արժեքային նիշերից.',
        'array' => ': հատկանիշը պետք է ունենա ավելի քիչ, քան ՝ արժեքային նյութեր.',
    ],
    'lte' => [
        'numeric' => ': ատրիբուտը պետք է լինի պակաս կամ հավասար: արժեք.',
        'file' => ': հատկանիշը պետք է լինի պակաս կամ հավասար: արժեքը կիլոբայթ.',
        'string' => ': հատկանիշը պետք է լինի պակաս կամ հավասար: արժեքային նիշերից.',
        'array' => ': հատկանիշը չպետք է ունենա ավելին: արժեքային կետերից.',
    ],
    'max' => [
        'numeric' => ': հատկանիշը չի կարող լինել ավելի մեծ, քան ՝ առավելագույնը.',
        'file' => ': հատկանիշը չի կարող լինել ավելի մեծ, քան ՝ առավելագույն կիլոբայթը.',
        'string' => ': հատկանիշը չի կարող լինել ավելի մեծ, քան `առավելագույն նիշերը.',
        'array' => ': հատկանիշը կարող է ունենալ ավելին, քան ՝ առավելագույն կետերը.',
    ],
    'mimes' => ': ատրիբուտը պետք է լինի տիպի ֆայլ ՝ արժեքները.',
    'mimetypes' => ': հատկանիշը պետք է լինի տիպի ֆայլ ՝ արժեքները.',
    'min' => [
        'numeric' => ': հատկանիշը պետք է լինի առնվազն: min.',
        'file' => ': հատկանիշը պետք է լինի առնվազն: min կիլոբայթ.',
        'string' => ': հատկանիշը պետք է լինի առնվազն: րոպե տառերով.',
        'array' => ': հատկանիշը պետք է ունենա առնվազն: min կետեր.',
    ],
    'not_in' => 'ընտրված: ատրիբուտը անվավեր է.',
    'not_regex' => ': հատկանիշի ձևաչափը անվավեր է.',
    'numeric' => ': հատկանիշը պետք է լինի թիվ.',
    'password' => 'գաղտնաբառը սխալ է.',
    'present' => ': ատրիբուտների դաշտը պետք է ներկա լինի.',
    'regex' => ': հատկանիշի ձևաչափը անվավեր է.',
    'required' => ' :պարտադիր է ատրիբուտների դաշտը.',
    'required_if' => ': ատրիբուտների դաշտը պարտադիր է, երբ `այլ` արժեքը.',
    'required_unless' => ': ատրիբուտների դաշտը պարտադիր է, եթե `այլ` արժեքներ: ',
    'required_with' => ': ատրիբուտների դաշտը պահանջվում է, երբ արժեքները առկա են.',
    'required_with_all' => ': ատրիբուտների դաշտը պահանջվում է, երբ առկա են արժեքները.',
    'required_without' => ': ատրիբուտների դաշտը պարտադիր է, երբ: արժեքները ներկա չեն.',
    'required_without_all' => ': ատրիբուտների դաշտը պարտադիր է, երբ արժեքներից ոչ մեկը չկա.',
    'same' => ': ատրիբուտ և: մյուսները պետք է համընկնեն.',
    'size' => [
        'numeric' => ': հատկանիշը պետք է լինի: չափը.',
        'file' => ': հատկանիշը պետք է լինի: չափը կիլոբայթ.',
        'string' => ': հատկանիշը պետք է լինի: չափի նիշ.',
        'array' => ': հատկանիշը պետք է պարունակի: չափի իրեր.',
    ],
    'start_with' => ': հատկանիշը պետք է սկսվի հետևյալներից մեկը: արժեքներ.',
    'string' => ': ատրիբուտը պետք է լինի տողը.',
    'timezone' => ': ատրիբուտը պետք է լինի վավեր գոտի.',
    'unique' => ': հատկանիշն արդեն վերցված է.',
    'uploaded' => ': հատկանիշը չի հաջողվել վերբեռնել.',
    'url' => ': հատկանիշի ձևաչափը անվավեր է.',
    'uuid' => ': ատրիբուտը պետք է լինի վավեր UUID.',

     /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'հատկանիշ-անուն' => [
            'rul-name' => 'սովորական հաղորդագրությու.',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email": This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
